insert into public.test (id, hello)
values  (1, 'Hello  new world!');

insert into public.frontend_data (id, front_id, text, created, changed, is_deleted)
values  (1, 1.1, 'Создай свой успех', '2023-07-09 20:54:37.000000', '2023-07-09 20:54:41.000000', false),
        (2, 1.2, 'Наши тренажеры разработаны на основе тестовых заданий работодателей. выполняя задания и зарабатывая баллы, ты найдешь работу мечты', '2023-07-09 20:56:46.000000', '2023-07-09 20:56:49.000000', false),
        (3, 1.3, 'SQL', '2023-07-09 20:59:20.000000', '2023-07-09 20:59:24.000000', false),
        (4, 1.4, 'Какой оператор позволяет создать страницу?', '2023-07-09 20:59:59.000000', '2023-07-09 21:00:01.000000', false),
        (5, 1.5, 'Python', '2023-07-09 21:00:26.000000', '2023-07-09 21:00:29.000000', false),
        (6, 1.6, 'Как получить остаток от деления в Python?', '2023-07-09 21:01:30.000000', '2023-07-09 21:01:32.000000', false);