-- Check if the record with id=1 already exists
INSERT INTO public.roles (id, role_name, created, changed, is_deleted)
SELECT 1, 'ROLE_ADMIN', '2023-07-13 16:33:07.000000', '2023-07-13 16:33:11.000000', false
    WHERE NOT EXISTS (SELECT 1 FROM public.roles WHERE id = 1);

-- Check if the record with id=2 already exists
INSERT INTO public.roles (id, role_name, created, changed, is_deleted)
SELECT 2, 'ROLE_USER', '2023-07-13 16:33:37.000000', '2023-07-13 16:33:42.000000', false
    WHERE NOT EXISTS (SELECT 1 FROM public.roles WHERE id = 2);


insert into public.frontend_data (id, front_id, text, created, changed, is_deleted)
values  (1, 1.1, 'Создай свой успех', '2023-07-09 20:54:37.000000', '2023-07-09 20:54:41.000000', false),
        (2, 1.2, 'Наши тренажеры разработаны на основе тестовых заданий работодателей. выполняя задания и зарабатывая баллы, ты найдешь работу мечты', '2023-07-09 20:56:46.000000', '2023-07-09 20:56:49.000000', false),
        (3, 1.3, 'Выполни задания', '2023-07-09 20:59:20.000000', '2023-07-09 20:59:24.000000', false),
        (5, 1.5, 'Повышай рейтинг', '2023-07-09 21:00:26.000000', '2023-07-09 21:00:29.000000', false),
        (6, 1.6, 'Твоя работа найдет тебя', '2023-07-09 21:01:30.000000', '2023-07-09 21:01:32.000000', false),
        (4, 1.4, 'Собирай баллы', '2023-07-09 20:59:59.000000', '2023-07-09 21:00:01.000000', false),
        (7, 1.7, 'Все права защищены. Любое использование либо копирование материалов и (или) подборки материалов сайта, элементов дизайна и оформления допускается лишь с письменного разрешения правообладателя и только со ссылкой на источник: URL', '2023-07-09 22:55:03.000000', '2023-07-09 22:55:05.000000', false),
        (8, 1.8, 'Здесь будет история успеха нашего пользователя', '2023-07-09 22:56:16.000000', '2023-07-09 22:56:17.000000', false),
        (9, 1.9, '© 2023 OOO «ХХХХХХХХ»', '2023-07-09 22:56:43.000000', '2023-07-09 22:56:44.000000', false);
ON CONFLICT (id) DO NOTHING;
